tutorials/untested/reactingRect2D/reactingRect2D_SimplePMT/0.org/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.005;                                         

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.005;                                   
    }
    
    "(outlet|sides)"
    {
        type        zeroGradient;
    }
        frontAndBack
    {
        type            empty;
    }
        "sym"
    {
        type        symmetry;
    }
}

// ************************************************************************* //
