tutorials/untested/reactingRect2D/reactingRect2D_SimplePMT/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField	uniform	(0 0 0.5);

boundaryField
{
    inlet
    {
        type            fixedValue;
	    value	uniform (0 0 0.5);
    }
    outlet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      uniform (0 0 0);
    }
    "(walls|sides)"
    {
        type            noSlip;
    }
        frontAndBack
    {
        type            empty;
    }
        "sym"
    {
        type        symmetry;
    }
}


// ************************************************************************* //
